In [12]:
import pandas as pd
import numpy as np

# generating a dummie dataset using chatgpt

# Create the original dataframe
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Isaac', 'Julia'],
    'Age': [25, 30, 22, 28, 33, 27, 24, 29, 31, 26],
    'Height (cm)': [165.5, 180.2, 172.8, 168.0, 175.3, 169.7, 163.4, 177.9, 170.6, 174.0],
    'Is_Employee': [True, False, True, True, False, True, False, True, True, False],
    'Favorite_Color': ['Blue', 'Red', 'Green', 'Yellow', 'Purple', 'Orange', 'Pink', 'Teal', 'Brown', 'Gray'],
    'Income': [55_000.0, 62_000.5, 48_000.75, 59_000.25, 54_000.0, 60_000.0, 51_000.5, 63_000.75, 57_000.25, 53_000.0],
    'Hobbies': [
        ['Reading', 'Cooking'],
        ['Hiking', 'Photography'],
        ['Painting', 'Gardening'],
        ['Running', 'Traveling'],
        ['Swimming', 'Music'],
        ['Coding', 'Yoga'],
        ['Dancing', 'Movies'],
        ['Cycling', 'Singing'],
        ['Chess', 'Writing'],
        ['Drawing', 'Sculpting']
    ]
}

# Create a dataframe from additional data
additional_data = {
    'Name': ['Katie', 'Liam', 'Mia', 'Noah', 'Olivia'],
    'Age': [22, 27, 26, 31, 25],
    'Height (cm)': [170.1, 175.8, 165.5, 172.3, 163.4],
    'Is_Employee': [True, True, False, True, False],
    'Favorite_Color': ['Yellow', 'Green', 'Blue', 'Red', 'Purple'],
    'Income': [59_000.20, 60_000.0, 49_000.5, 53_000.0, 55_000.75],
    'Hobbies': [
        ['Gardening', 'Movies'],
        ['Dancing', 'Hiking'],
        ['Coding', 'Photography'],
        ['Drawing', 'Cooking'],
        ['Cycling', 'Painting']
    ]
}

# Concatenate the dataframes
df = pd.concat([pd.DataFrame(data), pd.DataFrame(additional_data)], ignore_index=True)

# Display the updated dataframe
print(df)

       Name  Age  Height (cm)  Is_Employee Favorite_Color    Income  \
0     Alice   25        165.5         True           Blue  55000.00
1       Bob   30        180.2        False            Red  62000.50
2   Charlie   22        172.8         True          Green  48000.75
3     David   28        168.0         True         Yellow  59000.25
4       Eva   33        175.3        False         Purple  54000.00
5     Frank   27        169.7         True         Orange  60000.00
6     Grace   24        163.4        False           Pink  51000.50
7    Hannah   29        177.9         True           Teal  63000.75
8     Isaac   31        170.6         True          Brown  57000.25
9     Julia   26        174.0        False           Gray  53000.00
10    Katie   22        170.1         True         Yellow  59000.20
11     Liam   27        175.8         True          Green  60000.00
12      Mia   26        165.5        False           Blue  49000.50
13     Noah   31        172.3         True            Red  53000.00
14   Olivia   25        163.4        False         Purple  55000.75

                  Hobbies
0      [Reading, Cooking]
1   [Hiking, Photography]
2   [Painting, Gardening]
3    [Running, Traveling]
4       [Swimming, Music]
5          [Coding, Yoga]
6       [Dancing, Movies]
7      [Cycling, Singing]
8        [Chess, Writing]
9    [Drawing, Sculpting]
10    [Gardening, Movies]
11      [Dancing, Hiking]
12  [Coding, Photography]
13     [Drawing, Cooking]
14    [Cycling, Painting]

# Melt
Make a wide table long. Supports multiIndex


<table>
<thead>
    <tr style="text-align: right;">      
        <th>From</th>
        <th>To</th>
    </tr>
</thead>
<tbody>
    <tr style="text-align: center;">      
        <th>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>A</th>      <th>B</th>      <th>C</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>a</td>      <td>1</td>      <td>2</td>    </tr>    <tr>      <th>1</th>      <td>b</td>      <td>3</td>      <td>4</td>    </tr>    <tr>      <th>2</th>      <td>c</td>      <td>5</td>      <td>6</td>    </tr>  </tbody></table>
        </th>
        <th>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>A</th>      <th>variable</th>      <th>value</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>a</td>      <td>B</td>      <td>1</td>    </tr>    <tr>      <th>1</th>      <td>b</td>      <td>B</td>      <td>3</td>    </tr>    <tr>      <th>2</th>      <td>c</td>      <td>B</td>      <td>5</td>    </tr>    <tr>      <th>3</th>      <td>a</td>      <td>C</td>      <td>2</td>    </tr>    <tr>      <th>4</th>      <td>b</td>      <td>C</td>      <td>4</td>    </tr>    <tr>      <th>5</th>      <td>c</td>      <td>C</td>      <td>6</td>    </tr>  </tbody></table>
        </th>
    </tr>
</tbody>
</table>

In [29]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

# wide_to_long

Simple version of melt

# pivot

Basically a long table turned into a summery of the variable pair combinations.

Turn a column into the index, another column into headers, and a third column into associated values.

<table>
<thead>
    <tr style="text-align: right;">      
        <th>From</th>
        <th>To</th>
    </tr>
</thead>
<tbody>   
    <tr style="text-align: center;">
        <td>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>foo</th>      <th>bar</th>      <th>baz</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>one</td>      <td>A</td>      <td>1</td>    </tr>    <tr>      <th>1</th>      <td>one</td>      <td>B</td>      <td>2</td>    </tr>    <tr>      <th>2</th>      <td>one</td>      <td>C</td>      <td>3</td>    </tr>    <tr>      <th>3</th>      <td>two</td>      <td>A</td>      <td>4</td>    </tr>    <tr>      <th>4</th>      <td>two</td>      <td>B</td>      <td>5</td>    </tr>    <tr>      <th>5</th>      <td>two</td>      <td>C</td>      <td>6</td>    </tr>  </tbody></table>
        </td>
        <td>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th>bar</th>      <th>A</th>      <th>B</th>      <th>C</th>    </tr>    <tr>      <th>foo</th>      <th></th>      <th></th>      <th></th>    </tr>  </thead>  <tbody>    <tr>      <th>one</th>      <td>1</td>      <td>2</td>      <td>3</td>    </tr>    <tr>      <th>two</th>      <td>4</td>      <td>5</td>      <td>6</td>    </tr>  </tbody></table>
        </td>
    </tr>
</tbody>
</table>

In [44]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                #    'zoo': ['x', 'y', 'z', 'q', 'w', 't']
                })
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

# pivot_table

Same as pivot, but puts more elements in the value cell, which then are turned into one value using a function like sum. Allows mulitIndex for the rows. Allows multiple functions of which the results are added as columns.

<table>
<thead>
    <tr style="text-align: right;">      
        <th>From</th>
        <th>To</th>
    </tr>
</thead>
<tbody>   
    <tr style="text-align: center;">
        <td>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>A</th>      <th>B</th>      <th>C</th>      <th>D</th>      <th>E</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>foo</td>      <td>one</td>      <td>small</td>      <td>1</td>      <td>2</td>    </tr>    <tr>      <th>1</th>      <td>foo</td>      <td>one</td>      <td>large</td>      <td>2</td>      <td>4</td>    </tr>    <tr>      <th>2</th>      <td>foo</td>      <td>one</td>      <td>large</td>      <td>2</td>      <td>5</td>    </tr>    <tr>      <th>3</th>      <td>foo</td>      <td>two</td>      <td>small</td>      <td>3</td>      <td>5</td>    </tr>    <tr>      <th>4</th>      <td>foo</td>      <td>two</td>      <td>small</td>      <td>3</td>      <td>6</td>    </tr>    <tr>      <th>5</th>      <td>bar</td>      <td>one</td>      <td>large</td>      <td>4</td>      <td>6</td>    </tr>    <tr>      <th>6</th>      <td>bar</td>      <td>one</td>      <td>small</td>      <td>5</td>      <td>8</td>    </tr>    <tr>      <th>7</th>      <td>bar</td>      <td>two</td>      <td>small</td>      <td>6</td>      <td>9</td>    </tr>    <tr>      <th>8</th>      <td>bar</td>      <td>two</td>      <td>large</td>      <td>7</td>      <td>9</td>    </tr>  </tbody></table>
        </td>
        <td>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>C</th>      <th>large</th>      <th>small</th>    </tr>    <tr>      <th>A</th>      <th>B</th>      <th></th>      <th></th>    </tr>  </thead>  <tbody>    <tr>      <th rowspan="2" valign="top">bar</th>      <th>one</th>      <td>4.0</td>      <td>5.0</td>    </tr>    <tr>      <th>two</th>      <td>7.0</td>      <td>6.0</td>    </tr>    <tr>      <th rowspan="2" valign="top">foo</th>      <th>one</th>      <td>4.0</td>      <td>1.0</td>    </tr>    <tr>      <th>two</th>      <td>NaN</td>      <td>6.0</td>    </tr>  </tbody></table>    
        </td>
    </tr>
</tbody>
</table>

In [54]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
pd.pivot_table(df, values='D', index=['A', 'B'],
                       columns=['C'], aggfunc="sum")

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

# crosstab

Counts how many times values of a specific column appear for every item in another column.

Computes the frequency of factors. (works a bit like 'multi-one-hot' or MultiLabelBinarizer )

If duplicates are first removed before executing the crosstab function, you will get multi-one-hot.


<table>
<thead>
    <tr style="text-align: right;">      
        <th>From</th>
        <th>To</th>
    </tr>
</thead>
<tbody>   
    <tr style="text-align: center;">
        <td>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>movie</th>      <th>genre</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>The Matrix</td>      <td>action</td>    </tr>    <tr>      <th>1</th>      <td>The Matrix</td>      <td>sci-fi</td>    </tr>    <tr>      <th>3</th>      <td>Dr. Strangelove</td>      <td>war</td>    </tr>    <tr>      <th>4</th>      <td>Dr. Strangelove</td>      <td>comedy</td>    </tr>    <tr>      <th>5</th>      <td>Dr. Strangelove</td>      <td>comedy</td>    </tr>  </tbody></table>
        </td>
        <td>
            <table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th>genre</th>      <th>action</th>      <th>comedy</th>      <th>sci-fi</th>      <th>war</th>    </tr>    <tr>      <th>movie</th>      <th></th>      <th></th>      <th></th>      <th></th>    </tr>  </thead>  <tbody>    <tr>      <th>Dr. Strangelove</th>      <td>0</td>      <td>2</td>      <td>0</td>      <td>1</td>    </tr>    <tr>      <th>The Matrix</th>      <td>1</td>      <td>0</td>      <td>1</td>      <td>0</td>    </tr>  </tbody></table>
        </td>
    </tr>
</tbody>
</table>

In [68]:
df = pd.DataFrame({'movie': {0: 'The Matrix', 1: 'The Matrix', 3: 'Dr. Strangelove', 4: 'Dr. Strangelove', 5: 'Dr. Strangelove'},
                   'genre': {0: "action", 1: "sci-fi", 3: "war", 4: "comedy",  5: "comedy"}})
df.to_html().replace("\n",'')

'<table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th></th>      <th>movie</th>      <th>genre</th>    </tr>  </thead>  <tbody>    <tr>      <th>0</th>      <td>The Matrix</td>      <td>action</td>    </tr>    <tr>      <th>1</th>      <td>The Matrix</td>      <td>sci-fi</td>    </tr>    <tr>      <th>3</th>      <td>Dr. Strangelove</td>      <td>war</td>    </tr>    <tr>      <th>4</th>      <td>Dr. Strangelove</td>      <td>comedy</td>    </tr>    <tr>      <th>5</th>      <td>Dr. Strangelove</td>      <td>comedy</td>    </tr>  </tbody></table>'

In [69]:
pd.crosstab(df.movie, df.genre).to_html().replace("\n","")

'<table border="1" class="dataframe">  <thead>    <tr style="text-align: right;">      <th>genre</th>      <th>action</th>      <th>comedy</th>      <th>sci-fi</th>      <th>war</th>    </tr>    <tr>      <th>movie</th>      <th></th>      <th></th>      <th></th>      <th></th>    </tr>  </thead>  <tbody>    <tr>      <th>Dr. Strangelove</th>      <td>0</td>      <td>2</td>      <td>0</td>      <td>1</td>    </tr>    <tr>      <th>The Matrix</th>      <td>1</td>      <td>0</td>      <td>1</td>      <td>0</td>    </tr>  </tbody></table>'

# Explode

<table>
<thead>
    <tr style="text-align: right;">      
        <th>From</th>
        <th>To</th>
    </tr>
</thead>
<tbody>   
    <tr style="text-align: center;">
        <td>
            
        </td>
        <td>
            
        </td>
    </tr>
</tbody>
</table>

table.to_html().replace("\n","")

this also had a lot of interesting stuff: https://pandas.pydata.org/pandas-docs/stable/reference/frame.html